lesson-4-stress-testing/notes.txt
NGINX CONFIG
/opt/homebrew/etc/nginx/nginx.conf

# restart nginx
sudo nginx -s stop && sudo nginx



concurrent = 10; time = 30s;

WITHOUT CACHE
Transactions:                    151 hits
Availability:                 100.00 %
Elapsed time:                  29.67 secs
Data transferred:               0.03 MB
Response time:                  1.86 secs
Transaction rate:               5.09 trans/sec
Throughput:                     0.00 MB/sec
Concurrency:                    9.47
Successful transactions:         151
Failed transactions:               0
Longest transaction:            4.57
Shortest transaction:           0.05

WITH CACHE
Transactions:                    761 hits
Availability:                 100.00 %
Elapsed time:                  29.63 secs
Data transferred:               0.00 MB
Response time:                  0.38 secs
Transaction rate:              25.68 trans/sec
Throughput:                     0.00 MB/sec
Concurrency:                    9.88
Successful transactions:         761
Failed transactions:               0
Longest transaction:            0.53
Shortest transaction:           0.05


concurrent = 25; time = 30s;

WITHOUT CACHE
Transactions:                    146 hits
Availability:                 100.00 %
Elapsed time:                  29.59 secs
Data transferred:               0.03 MB
Response time:                  4.57 secs
Transaction rate:               4.93 trans/sec
Throughput:                     0.00 MB/sec
Concurrency:                   22.54
Successful transactions:         146
Failed transactions:               0
Longest transaction:            9.30
Shortest transaction:           0.40

WITH CACHE
Transactions:                    751 hits
Availability:                 100.00 %
Elapsed time:                  29.55 secs
Data transferred:               0.00 MB
Response time:                  0.95 secs
Transaction rate:              25.41 trans/sec
Throughput:                     0.00 MB/sec
Concurrency:                   24.25
Successful transactions:         751
Failed transactions:               0
Longest transaction:            1.01
Shortest transaction:           0.24



concurrent = 50; time = 30s;

WITHOUT CACHE
Transactions:                    141 hits
Availability:                 100.00 %
Elapsed time:                  29.04 secs
Data transferred:               0.02 MB
Response time:                  8.54 secs
Transaction rate:               4.86 trans/sec
Throughput:                     0.00 MB/sec
Concurrency:                   41.47
Successful transactions:         141
Failed transactions:               0
Longest transaction:           14.03
Shortest transaction:           2.30

WITH CACHE
Transactions:                    753 hits
Availability:                 100.00 %
Elapsed time:                  29.18 secs
Data transferred:               0.00 MB
Response time:                  1.90 secs
Transaction rate:              25.81 trans/sec
Throughput:                     0.00 MB/sec
Concurrency:                   49.06
Successful transactions:         753
Failed transactions:               0
Longest transaction:            2.13
Shortest transaction:           0.94



concurrent = 100; time = 30s;

WITHOUT CACHE
Transactions:                    143 hits
Availability:                 100.00 %
Elapsed time:                  29.29 secs
Data transferred:               0.02 MB
Response time:                 13.17 secs
Transaction rate:               4.88 trans/sec
Throughput:                     0.00 MB/sec
Concurrency:                   64.29
Successful transactions:         143
Failed transactions:               0
Longest transaction:           22.71
Shortest transaction:           4.09

WITH CACHE
Availability:                 100.00 %
Elapsed time:                  29.12 secs
Data transferred:               0.00 MB
Response time:                  3.77 secs
Transaction rate:              24.07 trans/sec
Throughput:                     0.00 MB/sec
Concurrency:                   90.72
Successful transactions:         701
Failed transactions:               0
Longest transaction:            3.82
Shortest transaction:           0.42